[
  { "input": "Quais são os médicos disponíveis?", "output": "Temos três especialistas: Dr. João Silva, Dra. Maria Costa e Dr. Pedro Santos." },
  { "input": "Onde fica a clínica?", "output": "A clínica oftalmológica está localizada na Rua das Palmeiras, 456." },
  { "input": "Posso marcar uma consulta com o Dr. João?", "output": "Claro! Dr. João está disponível de segunda a sexta, das 7h às 13h. Para qual exame você gostaria de agendar?" },
  { "input": "Quais exames vocês fazem?", "output": "Realizamos exames de acuidade visual, pressão intraocular e refração." },
  { "input": "Qual é o horário de funcionamento?", "output": "Funcionamos de segunda a sexta, das 7h às 13h." },
  { "input": "Posso marcar uma consulta fora do horário de funcionamento?", "output": "Infelizmente, só realizamos consultas de segunda a sexta, das 7h às 13h." },
  { "input": "Qual o horário da Dra. Maria?", "output": "Dra. Maria atende de segunda a sexta, das 7h às 13h." },
  { "input": "Vocês atendem no sábado?", "output": "Não, só funcionamos de segunda a sexta, das 7h às 13h." },
  { "input": "Vocês fazem exames de vista?", "output": "Sim, realizamos exames de acuidade visual, pressão intraocular e refração." },
  { "input": "Posso marcar uma consulta às 14h?", "output": "Desculpe, nosso horário de atendimento é apenas pela manhã, das 7h às 13h." },
  { "input": "Posso fazer um exame de refração?", "output": "Sim, podemos agendar um exame de refração. Para qual horário você gostaria de marcar?" },
  { "input": "Quando o Dr. Pedro está disponível?", "output": "Dr. Pedro atende de segunda a sexta, das 7h às 13h." },
  { "input": "Vocês atendem urgências?", "output": "Atendemos apenas consultas agendadas e exames de rotina, como acuidade visual e refração." },
  { "input": "Como faço para marcar um exame de pressão ocular?", "output": "Podemos agendar seu exame de pressão ocular. Qual o melhor dia e horário para você, dentro do nosso funcionamento das 7h às 13h?" },
  { "input": "A clínica funciona à tarde?", "output": "Não, só estamos abertos de segunda a sexta pela manhã, das 7h às 13h." },
  { "input": "Posso marcar uma consulta com a Dra. Maria Costa?", "output": "Claro! Dra. Maria atende das 7h às 13h. Qual exame você gostaria de realizar?" },
  { "input": "Vocês fazem exame de fundo de olho?", "output": "Sim, realizamos exames de fundo de olho dentro do nosso horário de funcionamento, das 7h às 13h." },
  { "input": "Quais são os horários disponíveis para o Dr. Pedro?", "output": "O Dr. Pedro tem horários disponíveis de segunda a sexta, das 7h às 13h." },
  { "input": "Eu preciso de um exame de acuidade visual. Posso agendar?", "output": "Claro! Podemos agendar seu exame de acuidade visual dentro do horário de funcionamento, das 7h às 13h." },
  { "input": "Eu quero fazer um exame de refração na terça-feira, pode ser?", "output": "Sim, podemos agendar seu exame de refração na terça-feira, dentro do nosso horário de 7h às 13h." },
  { "input": "Quais exames posso fazer com o Dr. João?", "output": "O Dr. João realiza exames de acuidade visual, pressão intraocular e refração." },
  { "input": "A clínica abre aos domingos?", "output": "Não, a clínica funciona apenas de segunda a sexta, das 7h às 13h." },
  { "input": "Eu posso fazer dois exames no mesmo dia?", "output": "Sim, podemos agendar múltiplos exames no mesmo dia, dentro do nosso horário de funcionamento, das 7h às 13h." },
  { "input": "Tem como agendar para amanhã às 10h?", "output": "Sim, temos horários disponíveis amanhã entre 7h e 13h. Vamos agendar às 10h?" },
  { "input": "Quais são os médicos especialistas?", "output": "Temos três especialistas: Dr. João Silva, Dra. Maria Costa e Dr. Pedro Santos." },
  { "input": "Eu gostaria de um exame de visão com a Dra. Maria, pode ser?", "output": "Claro! Dra. Maria está disponível das 7h às 13h. Podemos agendar?" },
  { "input": "Vocês fazem exames de rotina?", "output": "Sim, realizamos exames de acuidade visual, pressão intraocular e refração." },
  { "input": "Preciso de um exame de visão, posso marcar agora?", "output": "Sim, podemos agendar o exame de acuidade visual. Para qual horário você gostaria de marcar, dentro das 7h às 13h?" }
]